{
  "next_id": 5,
  "cases": [
    {
      "id": 1,
      "brand": "linde",
      "model": "e20",
      "series": "335",
      "error_code": "e225",
      "symptom": "no levanta carga",
      "checks_done": "bateria ok",
      "diagnosis": "🔍 PROBABLE CAUSE:  \nError code E225 on a Linde E20 Series 335 typically indicates a fault in the lift motor circuit or an issue with the lift motor itself. Since the truck does not lift the load (\"no levanta carga\"), the problem is likely related to the lift motor, its wiring, or the motor controller.\n\n📋 DIAGNOSTIC STEPS:  \n1. Verify the lift motor wiring harness and connectors for damage, corrosion, or loose connections.  \n2. Measure the voltage at the lift motor terminals during a lift command to confirm power delivery.  \n3. Test the lift motor windings for continuity and insulation resistance to ground.  \n4. Inspect the motor controller or inverter module for fault codes or visible damage.  \n5. Check the lift limit switches and safety interlocks that could inhibit lifting.  \n6. Review the truck’s diagnostic software for any logged faults related to the lift system.  \n7. If available, perform a motor function test via the truck’s diagnostic interface.\n\n⚠️ SAFETY NOTE:  \nAlways ensure the forklift is on a stable surface and the load is removed or secured before performing electrical tests or motor inspections. Disconnect the battery before inspecting wiring to prevent accidental short circuits.\n\n📚 REFERENCE:  \nLinde E20 Series 335 Service Manual – Electrical Troubleshooting Section  \nLinde Error Code List – E225: Lift Motor Circuit Fault\n\n💡 SIMILAR CASES:  \n- Faulty lift motor brushes or commutator causing intermittent operation.  \n- Damaged lift motor cable causing open circuit or short to ground.  \n- Controller board failure resulting in no output to lift motor despite command input.",
      "status": "resolved",
      "source": "ai",
      "tags": [],
      "created_at": "2025-12-18T23:35:06.737206",
      "updated_at": "2025-12-19T20:19:10.334907"
    },
    {
      "id": 2,
      "brand": "linde",
      "model": "e20",
      "series": "335",
      "error_code": "e225",
      "symptom": "no levanta carga",
      "checks_done": "bateria ok",
      "diagnosis": "🔍 PROBABLE CAUSE:  \nError code E225 on a Linde E20 (Series 335) typically indicates a fault related to the hydraulic system or the lift motor control circuit. Since the symptom is \"no levanta carga\" (does not lift load) and the battery is confirmed good, the issue likely involves:  \n- Hydraulic pump motor failure or electrical fault  \n- Faulty lift solenoid valve or wiring  \n- Lift motor controller malfunction  \n- Hydraulic pressure sensor or switch failure  \n\n📋 DIAGNOSTIC STEPS:  \n1. Verify the hydraulic pump motor operation by listening for motor activation or measuring current draw during lift command.  \n2. Inspect wiring and connectors between the controller and the lift motor/solenoid for damage or loose connections.  \n3. Test the lift solenoid valve operation by manually activating it (if safe and possible) or using a diagnostic tool to command lift function.  \n4. Check hydraulic pressure sensors or switches for correct operation and signal output to the controller.  \n5. Scan the truck’s control unit with Linde diagnostic software to confirm if E225 is accompanied by any secondary fault codes.  \n6. Review the lift motor controller module for faults or error states; reset or replace if necessary.  \n\n⚠️ SAFETY NOTE:  \nAlways ensure the forklift is on a stable surface with the load lowered before performing electrical or hydraulic tests. Use proper lockout/tagout procedures to prevent accidental activation during diagnostics.  \n\n📚 REFERENCE:  \n- Linde E20 Series 335 Service Manual, Electrical and Hydraulic Troubleshooting sections  \n- Linde Diagnostic Software User Guide for error code interpretation and live data monitoring  \n\n💡 SIMILAR CASES:  \n- E225 errors often coincide with intermittent lift motor faults due to wiring harness wear near the mast.  \n- Cases where lift solenoid coil failure caused no lift despite battery and controller being functional.  \n- Hydraulic pressure sensor failures causing the controller to inhibit lift motor operation as a safety measure.",
      "status": "open",
      "source": "ai",
      "tags": [],
      "created_at": "2025-12-19T20:12:24.337359",
      "updated_at": "2025-12-19T20:12:24.337359"
    },
    {
      "id": 3,
      "brand": "bt",
      "model": "ose250",
      "series": null,
      "error_code": "c31",
      "symptom": "mal funcionamiento del circuito hidraulico",
      "checks_done": "bateria ok, contactor ok",
      "diagnosis": "🔍 PROBABLE CAUSE:  \nEl código de error C31 en carretillas BT OSE250 generalmente indica un fallo en el sensor de presión hidráulica o en su cableado, provocando que el sistema interprete una carga máxima erróneamente y aumente la velocidad hidráulica. Esto puede deberse a un sensor defectuoso, conexiones flojas, cables dañados o interferencias eléctricas.\n\n📋 DIAGNOSTIC STEPS:  \n1. Realizar una inspección visual detallada del sensor hidráulico: buscar daños físicos, corrosión o suciedad.  \n2. Verificar la integridad del cableado del sensor: buscar cortes, aplastamientos, conexiones sueltas o terminales corroídos.  \n3. Medir la señal de salida del sensor con un multímetro o equipo de diagnóstico para confirmar que responde correctamente a cambios de presión.  \n4. Comparar la reacción hidráulica con los valores esperados según el manual técnico para el código C31.  \n5. Probar con un sensor hidráulico de repuesto si está disponible para descartar fallo interno del sensor.  \n6. Revisar la conexión a la unidad de control para asegurar que no haya falsos contactos o interferencias.  \n7. Borrar el código de error y realizar una prueba funcional para verificar si el problema persiste.  \n\n⚠️ SAFETY NOTE:  \nAntes de manipular el sistema hidráulico, asegúrese de que la carretilla esté apagada y bloqueada para evitar movimientos inesperados. Use equipo de protección personal adecuado para evitar lesiones por presión hidráulica o componentes eléctricos.\n\n📚 REFERENCE:  \n- Manual técnico BT OSE250, sección diagnóstico de sensores hidráulicos.  \n- Guía de códigos de error BT, código C31.  \n- Procedimientos estándar de inspección y prueba de sensores de presión hidráulica.\n\n💡 SIMILAR CASES:  \nCasos reportados donde el sensor de presión hidráulica presentaba falsos positivos por cables dañados o conectores corroídos, causando aumento erróneo de velocidad hidráulica y códigos C31. Reemplazo o reparación del cableado solucionó el problema.",
      "status": "open",
      "source": "ai",
      "tags": [],
      "created_at": "2025-12-20T16:09:24.413715",
      "updated_at": "2025-12-20T16:09:24.413715"
    },
    {
      "id": 4,
      "brand": "bt",
      "model": "ose250",
      "series": null,
      "error_code": "c31",
      "symptom": "falla hidraulico",
      "checks_done": "bateria ok, contactor ok",
      "diagnosis": "🔍 PROBABLE CAUSE:  \nError code C31 in BT OSE250 indicates a fault in the hydraulic sensor or its wiring. The system misinterprets the sensor signal as a maximum load condition, causing an unintended increase in hydraulic speed. This is consistent with the manual’s description of sensor or cable failure leading to erroneous hydraulic behavior.\n\n📋 DIAGNOSTIC STEPS:  \n1. Visually inspect the hydraulic sensor for physical damage, contamination, or misalignment.  \n2. Examine the hydraulic sensor wiring harness for cuts, abrasions, loose connections, or corrosion at connectors.  \n3. Using a multimeter, verify continuity and resistance values of the sensor wiring according to the manufacturer’s specifications.  \n4. Check the sensor output signal with a diagnostic tool or oscilloscope to confirm it matches expected hydraulic load readings.  \n5. Compare hydraulic system response to the error code behavior; confirm if the system is increasing hydraulic speed erroneously.  \n6. Repair or replace any damaged sensor or wiring components found during inspection.  \n7. Clear the error code and test the system to verify the fault is resolved.\n\n⚠️ SAFETY NOTE:  \nAlways disconnect the battery and follow lockout/tagout procedures before inspecting or repairing electrical components to prevent accidental startup or electric shock. Use appropriate personal protective equipment when working around hydraulic systems to avoid injury from pressurized fluids.\n\n📚 REFERENCE:  \nBT OSE250 service manual, hydraulic sensor troubleshooting section; error code C31 diagnostic procedure.\n\n💡 SIMILAR CASES:  \nDocumented cases show that loose sensor connectors or damaged sensor cables frequently cause error C31, resulting in hydraulic speed anomalies. Replacing faulty cables or securing connectors typically resolves the issue.",
      "status": "open",
      "source": "ai",
      "tags": [],
      "created_at": "2025-12-20T21:27:53.355719",
      "updated_at": "2025-12-20T21:27:53.355719"
    }
  ]
}